#****************************************************************************************
# Разница первого порядка
def firstLevel(x0, x1, y0, y1):
    return (y1 - y0)/(x1 - x0)
#****************************************************************************************

#****************************************************************************************
# Разница второго порядка
def secondLevel(x0, x1, x2, y0, y1, y2):
    return (firstLevel(x1, x2, y1, y2) - firstLevel(x0, x1, y0, y1)) / (x2 - x0)
#****************************************************************************************

#****************************************************************************************
# Формула Ньютона
def NewtonFunction(x, list_x, list_y):
    lenx = len(list_x)
    leny = len(list_y)
    
    if lenx != leny and lenx < 3:
        return None

    return [list_y[i] + 
            (firstLevel(list_x[i], list_x[i+1], list_y[i], list_y[i+1])* (x-list_x[i]))+ 
            (secondLevel(list_x[i], list_x[i+1], list_x[i+2], list_y[i], list_y[i+1], list_y[i+2])*(x-list_x[i]) * (x-list_x[i+1])) 
            for i in range(int(lenx/2))]
#****************************************************************************************

#****************************************************************************************
# Вариант выполнения
variant_x = [0.298, 0.303, 0.310, 0.317, 0.323, 0.330, 0.339]
variant_y = [3.25578, 3.17639, 3.12180, 3.04819, 2.98755, 2.91950, 2.83598]
value1 = 0.312
value2 = 0.304
#****************************************************************************************

#****************************************************************************************
# Вызов функций
result1 = NewtonFunction(value1, variant_x, variant_y)
result2 = NewtonFunction(value2, variant_x[2:], variant_y[2:])

print("Запуск для значения %f - Результат: %s" % (value1, result1))
print("Запуск для значения %f - Результат: %s" % (value2, result2))
#****************************************************************************************

